added architectural design
